# ImagePlacementOptions Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ImagePlacementOptions Properties
ImagePlacementOptions Class See Also
---
The ImagePlacementOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Location | The location in the model where a point of the ImageInstance, determined by the PlacementPoint property, is going to be inserted. |
| PlacementPoint | Identifies which point of the ImageInstance will be aligned to the Location |

# See Also
ImagePlacementOptions Class
Autodesk.Revit.DB Namespace